app/controllers/ride_controller.rb

  def index

    d1 = Driver.all.first
    p1 = Passenger.all.first
    r = Ride.new(driver:d1,passenger:p1,pickup_location:"bella vista 234",dropoff_location:"san joaquin",status:"requested",fare:"2000 CLP")
    r.save
    logger.debug "Ride ID: #{r.id}"
    logger.info "Processing the request..."
    logger.fatal "Terminating application, raised unrecoverable error!!!"
    @rides = Ride.all
---
SELECT "drivers".* FROM "drivers" ORDER BY "drivers"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "passengers".* FROM "passengers" ORDER BY "passengers"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "rides" ("driver_id", "passenger_id", "pickup_location", "dropoff_location", "status", "fare", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "rides".* FROM "rides"